app/views/articles/_form.html.erb

  <div class = "c-select">
  <%= form.collection_select :category_id, Category.all, :id, :name,
  {prompt: 'Choose a Category'}, class: 'form-control' %></div>
---
SELECT "categories".* FROM "categories"