app/views/articles/index.html.erb

SELECT "categories".* FROM "categories"
---
  <%# <li> <%= link_to 'All Categories', root_path %> </li>
  <% Category.all.each do |category| %>