app/views/tutorials/index.html.erb

SELECT "tutorials".* FROM "tutorials"
---
      <p><%= tutorial.name %></p>
      <% tutorial.subtutorials.each do |subtutorial| %>