app/controllers/communities_controller.rb

    def index
        @communities = Community.all
---
SELECT "communities".* FROM "communities"

    def show
    @posts = @community.posts
    @subscriber_count = @community.subscribers.count
    @is_subscribed = student_signed_in? ? Subscription.where(community_id: @community.id, student_id: current_student.id).any? : false
---
SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = ?  [["community_id", 1]]

    def create
        @community = Community.new community_values
        @community.student_id = current_student.id

        if @community.save
---
INSERT INTO "communities" ("student_id", "name", "url", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_community
        @community = Community.find(params[:id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]