app/controllers/home_controller.rb

SELECT "communities".* FROM "communities" LIMIT ?  [["LIMIT", 5]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC, "desc" ASC LIMIT ?  [["LIMIT", 20]]
---
  def index
    @communities = Community.all.limit(5)
    @posts = Post.order(id: :desc).limit(20)