app/controllers/posts_controller.rb

    def new
        @community = Community.find(params[:community_id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @post = Post.new post_values
        @post.student_id = current_student.id
        @post.community_id = params[:community_id]

        if @post.save
            redirect_to community_path(@post.community_id)
        else
            @community = Community.find(params[:community_id])
---
INSERT INTO "posts" ("student_id", "community_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["student_id", 1], ["community_id", 1], ["title", "My first post"], ["body", "omeeds post"], ["created_at", "2020-12-26 03:48:48.269850"], ["updated_at", "2020-12-26 03:48:48.269850"]]
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_post
        @post = Post.includes(:comments).find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]