app/controllers/tutorials_controller.rb

SELECT "tutorials".* FROM "tutorials" WHERE "tutorials"."parent_id" IS NULL
---
  def index
    @tutorials = Tutorial.where(parent_id: nil)