app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email", ""], ["phone", ""], ["created_at", "2020-12-24 05:35:33.523835"], ["updated_at", "2020-12-24 05:35:33.523835"]]